nc: 80  
scales:
  n: [0.33, 0.25, 1024]  # [depth, width, max_channels]

# Model Definition
backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [768, swin_t, None, True, 5, True]]         
  - [0, 1, Index, [192, 4]]                                          
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]]                
  - [0, 1, Index, [384, 6]]                                          
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]]                
  - [0, 1, Index, [768, 8]]                                        
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]]                
  - [-1, 1, SPPF, [768, 5]]                                         

head:
  - [7, 1, nn.Upsample, [None, 2, "nearest"]]                        
  - [[8, 4], 1, Concat, [1]]                                         
  - [-1, 3, C2f, [512]]                                             

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]                      
  - [[11, 2], 1, Concat, [1]]                                       
  - [-1, 3, C2f, [256]]                                              

  - [-1, 1, Conv, [256, 3, 2]]                                      
  - [[14, 10], 1, Concat, [1]]                                      
  - [-1, 3, C2f, [512]]                                             

  - [-1, 1, SCDown, [512, 3, 2]]                                    
  - [[17, 7], 1, Concat, [1]]                                     
  - [-1, 3, C2fCIB, [1024, True, True]]                             

  - [[13, 16, 19], 1, v10Detect, [nc]]                              
